# Color Field

---
C#Visual BasicVisual C++
Revit 2024 API
---
CloudPoint..::..Color Field
CloudPoint Structure See Also
---
The color
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Color
```

Visual Basic
---
```text
Public Color As Integer
```

Visual C++
---
```text
public:
int Color
```

# See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace